gallmd-stm32/blinky/src/main.cpp
/*
******************************************************************************
File:     main.cpp
Info:     Generated by Atollic TrueSTUDIO(R) 9.0.1   2018-09-22

The MIT License (MIT)
Copyright (c) 2018 STMicroelectronics

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
SOFTWARE.

******************************************************************************
*/

/* Includes */
#include "stm32f4xx.h"
#include "reg_access.h"
#include "registers.h"
#include "gpio.h"

/* Private macro */
/* Private variables */
/* Private function prototypes */
/* Private functions */

GPIO_InitTypeDef  GPIO_InitStructure;
void Delay(__IO uint32_t nCount);




/**
**===========================================================================
**
**  Abstract: main program
**
**===========================================================================
*/
int main(void)
{

	  /*!< At this stage the microcontroller clock setting is already configured,
	       this is done through SystemInit() function which is called from startup
	       file (startup_stm32f4xx.s) before to branch to application main.
	       To reconfigure the default setting of SystemInit() function, refer to
	        system_stm32f4xx.c file
	     */

	  /* GPIOD Periph clock enable */
	  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOD, ENABLE);
	  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOE, ENABLE);


	  /* Configure PD12, PD13, PD14 and PD15 in output pushpull mode */
//	  GPIO_InitStructure.GPIO_Pin =  GPIO_Pin_13| GPIO_Pin_14| GPIO_Pin_15;
//	  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
//	  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
//	  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
//	  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
//	  GPIO_Init(GPIOD, &GPIO_InitStructure);

	  const GPIO<GPIOxBaseRegisters::GPIO_E,
	  	  PINS::PIN0,
		  GpioModes::Output,
		  OutputTypes::PushPull,
		  OutputSpeed::MediumSpeed,
		  PullUpPullDown::NoPullUpPullDown,
		  AlternateFunction::AF15>testGPIO;
	  const GPIO<GPIOxBaseRegisters::GPIO_E,
	  	  PINS::PIN2,
		  GpioModes::Output,
		  OutputTypes::PushPull,
		  OutputSpeed::MediumSpeed,
		  PullUpPullDown::NoPullUpPullDown,
		  AlternateFunction::AF15>testGPIO1;
	  const GPIO<GPIOxBaseRegisters::GPIO_E,
	  	  PINS::PIN4,
		  GpioModes::Output,
		  OutputTypes::PushPull,
		  OutputSpeed::MediumSpeed,
		  PullUpPullDown::NoPullUpPullDown,
		  AlternateFunction::AF15>testGPIO2;
	  const GPIO<GPIOxBaseRegisters::GPIO_E,
	  	  PINS::PIN6,
		  GpioModes::Output,
		  OutputTypes::PushPull,
		  OutputSpeed::MediumSpeed,
		  PullUpPullDown::NoPullUpPullDown,
		  AlternateFunction::AF15>testGPIO3;
	  const GPIO<GPIOxBaseRegisters::GPIO_E,
	  	  PINS::PIN8,
		  GpioModes::Output,
		  OutputTypes::PushPull,
		  OutputSpeed::MediumSpeed,
		  PullUpPullDown::NoPullUpPullDown,
		  AlternateFunction::AF15>testGPIO4;
	  const GPIO<GPIOxBaseRegisters::GPIO_E,
	  	  PINS::PIN10,
		  GpioModes::Output,
		  OutputTypes::PushPull,
		  OutputSpeed::MediumSpeed,
		  PullUpPullDown::NoPullUpPullDown,
		  AlternateFunction::AF15>testGPIO5;
	  const GPIO<GPIOxBaseRegisters::GPIO_E,
	  	  PINS::PIN12,
		  GpioModes::Output,
		  OutputTypes::PushPull,
		  OutputSpeed::MediumSpeed,
		  PullUpPullDown::NoPullUpPullDown,
		  AlternateFunction::AF15>testGPIO6;
	  const GPIO<GPIOxBaseRegisters::GPIO_E,
	  	  PINS::PIN14,
		  GpioModes::Output,
		  OutputTypes::PushPull,
		  OutputSpeed::MediumSpeed,
		  PullUpPullDown::NoPullUpPullDown,
		  AlternateFunction::AF15>testGPIO7;

	  const GPIO<GPIOxBaseRegisters::GPIO_D,
	  	  PINS::PIN12,
		  GpioModes::Output,
		  OutputTypes::PushPull,
		  OutputSpeed::MediumSpeed,
		  PullUpPullDown::NoPullUpPullDown,
		  AlternateFunction::AF0>greenLED;

	  const GPIO<GPIOxBaseRegisters::GPIO_D,
	  	  PINS::PIN13,
		  GpioModes::Output,
		  OutputTypes::PushPull,
		  OutputSpeed::MediumSpeed,
		  PullUpPullDown::NoPullUpPullDown,
		  AlternateFunction::AF0>orangeLED;

	  const GPIO<GPIOxBaseRegisters::GPIO_D,
	  	  PINS::PIN14,
		  GpioModes::Output,
		  OutputTypes::PushPull,
		  OutputSpeed::MediumSpeed,
		  PullUpPullDown::NoPullUpPullDown,
		  AlternateFunction::AF0>redLED;

	  const GPIO<GPIOxBaseRegisters::GPIO_D,
	  	  PINS::PIN15,
		  GpioModes::Output,
		  OutputTypes::PushPull,
		  OutputSpeed::MediumSpeed,
		  PullUpPullDown::NoPullUpPullDown,
		  AlternateFunction::AF0>blueLED;


//	reg_access<uint32_t, uint32_t, stm32fxx::registers::GPIOD_MODER, stm32fxx::bits::BIT1>::reg_or();

  int i = 0;

  /**
  *  IMPORTANT NOTE!
  *  The symbol VECT_TAB_SRAM needs to be defined when building the project
  *  if code has been located to RAM and interrupts are used. 
  *  Otherwise the interrupt table located in flash will be used.
  *  See also the <system_*.c> file and how the SystemInit() function updates 
  *  SCB->VTOR register.  
  *  E.g.  SCB->VTOR = 0x20000000;  
  */

  /* TODO - Add your application code here */

  /* Infinite loop */
  while (1)
  {
//	  reg_access<uint32_t, uint32_t, stm32fxx::registers::GPIOD_ODR, stm32fxx::bits::BIT12>::reg_xor();
	  greenLED.toggle();
	  orangeLED.toggle();
	  redLED.toggle();
	  blueLED.toggle();
//	  reg_access<uint32_t, uint32_t, stm32fxx::registers::GPIOD_ODR, stm32fxx::bits::BIT13>::reg_xor();
//	  reg_access<uint32_t, uint32_t, stm32fxx::registers::GPIOD_ODR, stm32fxx::bits::BIT14>::reg_xor();
//	  reg_access<uint32_t, uint32_t, stm32fxx::registers::GPIOD_ODR, stm32fxx::bits::BIT15>::reg_xor();

	  Delay(0xFFFFFF);
	i++;

  }
}

/**
  * @brief  Delay Function.
  * @param  nCount:specifies the Delay time length.
  * @retval None
  */
void Delay(__IO uint32_t nCount)
{
  while(nCount--)
  {
  }
}
